# PointOnLine3D

Represents a Point dependent on the line in three-dimensional space.

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** | Element Id | [optional]

## Example

```python
from ideastatica_rcs_api.models.point_on_line3_d import PointOnLine3D

# TODO update the JSON string below
json = "{}"
# create an instance of PointOnLine3D from a JSON string
point_on_line3_d_instance = PointOnLine3D.from_json(json)
# print the JSON string representation of the object
print(PointOnLine3D.to_json())

# convert the object into a dict
point_on_line3_d_dict = point_on_line3_d_instance.to_dict()
# create an instance of PointOnLine3D from a dict
point_on_line3_d_from_dict = PointOnLine3D.from_dict(point_on_line3_d_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)